Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_lb_listener_rule.listener_rule has been changed
~ resource "aws_lb_listener_rule" "listener_rule" {
        id           = "arn:aws:elasticloadbalancing:us-east-1:096370227225:listener-rule/app/atlantis-lb-tf/2bf03333af158c1c/1c2d3f9400f0ba0a/b7977c7e1f501977"
      + tags         = {}
        # (4 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # aws_lb_listener.lb_listener has been changed
~ resource "aws_lb_listener" "lb_listener" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:096370227225:listener/app/atlantis-lb-tf/2bf03333af158c1c/1c2d3f9400f0ba0a"
      + tags              = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lb_listener.lb_listener will be updated in-place
~ resource "aws_lb_listener" "lb_listener" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:096370227225:listener/app/atlantis-lb-tf/2bf03333af158c1c/1c2d3f9400f0ba0a"
        tags              = {}
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:096370227225:targetgroup/tf-main-lb-tg/4abfbcc6d5f1d563" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_listener_rule.listener_rule will be updated in-place
~ resource "aws_lb_listener_rule" "listener_rule" {
        id           = "arn:aws:elasticloadbalancing:us-east-1:096370227225:listener-rule/app/atlantis-lb-tf/2bf03333af158c1c/1c2d3f9400f0ba0a/b7977c7e1f501977"
        tags         = {}
        # (4 unchanged attributes hidden)

      ~ action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:096370227225:targetgroup/tf-main-lb-tg/4abfbcc6d5f1d563" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group.main must be replaced
-/+ resource "aws_lb_target_group" "main" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-1:096370227225:targetgroup/tf-main-lb-tg/4abfbcc6d5f1d563" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/tf-main-lb-tg/4abfbcc6d5f1d563" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-1:096370227225:targetgroup/tf-main-lb-tg/4abfbcc6d5f1d563" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
        name                               = "tf-main-lb-tg"
      ~ port                               = 4141 -> 80 # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ health_check {
          ~ enabled             = true -> (known after apply)
          ~ healthy_threshold   = 5 -> (known after apply)
          ~ interval            = 30 -> (known after apply)
          ~ matcher             = "200" -> (known after apply)
          ~ path                = "/" -> (known after apply)
          ~ port                = "traffic-port" -> (known after apply)
          ~ protocol            = "HTTP" -> (known after apply)
          ~ timeout             = 5 -> (known after apply)
          ~ unhealthy_threshold = 2 -> (known after apply)
        }

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }
    }

  # aws_lb_target_group_attachment.main must be replaced
-/+ resource "aws_lb_target_group_attachment" "main" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:096370227225:targetgroup/tf-main-lb-tg/4abfbcc6d5f1d563-20210531180812279800000001" -> (known after apply)
      ~ port             = 4141 -> 80 # forces replacement
      ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:096370227225:targetgroup/tf-main-lb-tg/4abfbcc6d5f1d563" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.jmvbxx.com/lock?id=jmvbxx%252Fatlantis-ansible%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>
Plan: 2 to add, 2 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
